QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
.equ VPORTF_DIR = 0x0014                 ; Data Direction
.equ VPORTF_OUT = 0x0015                 ; Output Value
.equ VPORTF_IN = 0x0016                  ; Input Value
.equ VPORTF_INTFLAGS = 0x0017            ; Interrupt Flags

;*************************************************************************
;** VREF - Voltage reference
;*************************************************************************

.equ VREF_DAC0REF = 0x00B2               ; DAC0 Reference
.equ VREF_ACREF = 0x00B4                 ; AC Reference

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

.equ WDT_CTRLA = 0x0100                  ; Control A
.equ WDT_STATUS = 0x0101                 ; Status

;*************************************************************************
;** WEX0 - Waveform Extension
;*************************************************************************

.equ WEX0_CTRLA = 0x0C80                 ; Control A
.equ WEX0_CTRLB = 0x0C81                 ; Control B
.equ WEX0_CTRLC = 0x0C82                 ; Control C
.equ WEX0_EVCTRLA = 0x0C84               ; Event Control A
.equ WEX0_EVCTRLB = 0x0C85               ; Event Control B
.equ WEX0_EVCTRLC = 0x0C86               ; Event Control C
.equ WEX0_BUFCTRL = 0x0C87               ; Buffer Valid Control
.equ WEX0_BLANKCTRL = 0x0C88             ; Blanking Control
.equ WEX0_BLANKTIME = 0x0C89             ; Blanking Time
.equ WEX0_FAULTCTRL = 0x0C8A             ; Fault Control
.equ WEX0_FAULTDRV = 0x0C8B              ; Fault Drive
.equ WEX0_FAULTOUT = 0x0C8C              ; Fault Output
.equ WEX0_INTCTRL = 0x0C8D               ; Interrupt Control
.equ WEX0_INTFLAGS = 0x0C8E              ; Interrupt Flags
.equ WEX0_STATUS = 0x0C8F                ; Status
.equ WEX0_DTLS = 0x0C90                  ; Dead-time Low Side
.equ WEX0_DTHS = 0x0C91                  ; Dead-time High Side
.equ WEX0_DTBOTH = 0x0C92                ; Dead-time Both Sides
.equ WEX0_SWAP = 0x0C93                  ; DTI Swap
.equ WEX0_PGMOVR = 0x0C94                ; Pattern Generation Override
.equ WEX0_PGMOUT = 0x0C95                ; Pattern Generation Output
.equ WEX0_OUTOVEN = 0x0C97               ; Output Override Enable
.equ WEX0_DTLSBUF = 0x0C98               ; Dead-time Low Side Buffer
.equ WEX0_DTHSBUF = 0x0C99               ; Dead-time High Side Buffer
.equ WEX0_DTBOTHBUF = 0x0C9A             ; Dead-time Both Sides Buffer
.equ WEX0_SWAPBUF = 0x0C9B               ; DTI Swap Buffer
.equ WEX0_PGMOVRBUF = 0x0C9C             ; Pattern Generation Override Buffer
.equ WEX0_PGMOUTBUF = 0x0C9D             ; Pattern Generation Output Buffer


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ AC0_base = 0x0680                   ; Analog Comparator
.equ AC1_base = 0x0688                   ; Analog Comparator
.equ ADC0_base = 0x0600                  ; Analog to Digital Converter
.equ BOD_base = 0x00A0                   ; Bod interface
.equ BOOTROW_base = 0x1100               ; Boot Row
.equ CCL_base = 0x01C0                   ; Configurable Custom Logic
.equ CLKCTRL_base = 0x0060               ; Clock controller
.equ CPU_base = 0x0030                   ; CPU
.equ CPUINT_base = 0x0110                ; Interrupt Controller
.equ CRCSCAN_base = 0x0120               ; CRCSCAN
.equ EVSYS_base = 0x0200                 ; Event System
.equ FUSE_base = 0x1050                  ; Fuses
.equ GPR_base = 0x001C                   ; General Purpose Registers
.equ LOCK_base = 0x1040                  ; Lockbits
.equ NVMCTRL_base = 0x1000               ; Non-volatile Memory Controller
.equ PORTA_base = 0x0400                 ; I/O Ports
.equ PORTC_base = 0x0440                 ; I/O Ports
.equ PORTD_base = 0x0460                 ; I/O Ports
.equ PORTF_base = 0x04A0                 ; I/O Ports
.equ PORTMUX_base = 0x05E0               ; Port Multiplexer
.equ RSTCTRL_base = 0x0040               ; Reset controller
.equ RTC_base = 0x0140                   ; Real-Time Counter
.equ SIGROW_base = 0x1080                ; Signature row
.equ SLPCTRL_base = 0x0050               ; Sleep Controller
.equ SPI0_base = 0x0940                  ; Serial Peripheral Interface
.equ SYSCFG_base = 0x0F00                ; System Configuration Registers
.equ TCB0_base = 0x0B00                  ; 16-bit Timer/Counter Type B
.equ TCB1_base = 0x0B10                  ; 16-bit Timer/Counter Type B
.equ TCE0_base = 0x0A00                  ; 16-bit Timer/Counter Type E
.equ TCF0_base = 0x0C00                  ; 24-bit Timer/Counter for frequency generation
.equ TWI0_base = 0x0900                  ; Two-Wire Interface
.equ USART0_base = 0x0800                ; Universal Synchronous and Asynchronous Receiver and Transmitter
.equ USERROW_base = 0x1200               ; User Row
.equ VPORTA_base = 0x0000                ; Virtual Ports
.equ VPORTC_base = 0x0008                ; Virtual Ports
.equ VPORTD_base = 0x000C                ; Virtual Ports
.equ VPORTF_base = 0x0014                ; Virtual Ports
.equ VREF_base = 0x00B0                  ; Voltage reference
.equ WDT_base = 0x0100                   ; Watch-Dog Timer
.equ WEX0_base = 0x0C80                  ; Waveform Extension


; ***** IO REGISTER OFFSETS **********************************************


;*************************************************************************
;** AC - Analog Comparator
;*************************************************************************
.equ AC_CTRLA_offset = 0x00              ; Control A
.equ AC_CTRLB_offset = 0x01              ; Control B
.equ AC_MUXCTRL_offset = 0x02            ; Mux Control A
.equ AC_DACREF_offset = 0x05             ; DAC Voltage Reference
.equ AC_INTCTRL_offset = 0x06            ; Interrupt Control
.equ AC_STATUS_offset = 0x07             ; Status

;*************************************************************************
;** ADC - Analog to Digital Converter
;*************************************************************************
.equ ADC_CTRLA_offset = 0x00             ; Control A
.equ ADC_CTRLB_offset = 0x01             ; Control B
.equ ADC_CTRLC_offset = 0x02             ; Control C
.equ ADC_CTRLD_offset = 0x03             ; Control D
.equ ADC_INTCTRL_offset = 0x04           ; Interrupt Control
.equ ADC_INTFLAGS_offset = 0x05          ; Interrupt Flags
.equ ADC_STATUS_offset = 0x06            ; Status register
.equ ADC_DBGCTRL_offset = 0x07           ; Debug Control
.equ ADC_CTRLE_offset = 0x08             ; Control E
.equ ADC_CTRLF_offset = 0x09             ; Control F
.equ ADC_COMMAND_offset = 0x0A           ; Command register
.equ ADC_PGACTRL_offset = 0x0B           ; PGA Control
.equ ADC_MUXPOS_offset = 0x0C            ; Positive Input Multiplexer
.equ ADC_MUXNEG_offset = 0x0D            ; Negative Input Multiplexer
.equ ADC_RESULT_offset = 0x10            ; Result
.equ ADC_SAMPLE_offset = 0x14            ; Sample
.equ ADC_TEMP0_offset = 0x18             ; Temporary Data 0
.equ ADC_TEMP1_offset = 0x19             ; Temporary Data 1
.equ ADC_TEMP2_offset = 0x1A             ; Temporary Data 2
.equ ADC_WINLT_offset = 0x1C             ; Window Low Threshold
.equ ADC_WINHT_offset = 0x1E             ; Window High Threshold

;*************************************************************************
;** BOD - Bod interface
;*************************************************************************
.equ BOD_CTRLA_offset = 0x00             ; Control A
.equ BOD_CTRLB_offset = 0x01             ; Control B
.equ BOD_VLMCTRLA_offset = 0x08          ; Voltage level monitor Control
.equ BOD_INTCTRL_offset = 0x09           ; Voltage level monitor interrupt Control
.equ BOD_INTFLAGS_offset = 0x0A          ; Voltage level monitor interrupt Flags
.equ BOD_STATUS_offset = 0x0B            ; Voltage level monitor status

;*************************************************************************
;** BOOTROW - Boot Row
;*************************************************************************
.equ BOOTROW_BOOTROW_offset = 0x00       ; Boot Row
.equ BOOTROW_BOOTROW_count = 0x40        ; Number of Boot Row
.equ BOOTROW_BOOTROW_size = 0x01         ; Size of Boot Row in bytes

;*************************************************************************
;** CCL - Configurable Custom Logic
;*************************************************************************
.equ CCL_CTRLA_offset = 0x00             ; Control Register A
.equ CCL_SEQCTRL0_offset = 0x01          ; Sequential Control 0
.equ CCL_SEQCTRL1_offset = 0x02          ; Sequential Control 1
.equ CCL_INTCTRL0_offset = 0x05          ; Interrupt Control 0
.equ CCL_INTFLAGS_offset = 0x07          ; Interrupt Flags
.equ CCL_LUT0CTRLA_offset = 0x08         ; LUT 0 Control A
.equ CCL_LUT0CTRLB_offset = 0x09         ; LUT 0 Control B
.equ CCL_LUT0CTRLC_offset = 0x0A         ; LUT 0 Control C
.equ CCL_TRUTH0_offset = 0x0B            ; Truth 0
.equ CCL_LUT1CTRLA_offset = 0x0C         ; LUT 1 Control A
.equ CCL_LUT1CTRLB_offset = 0x0D         ; LUT 1 Control B
.equ CCL_LUT1CTRLC_offset = 0x0E         ; LUT 1 Control C
.equ CCL_TRUTH1_offset = 0x0F            ; Truth 1
.equ CCL_LUT2CTRLA_offset = 0x10         ; LUT 2 Control A
.equ CCL_LUT2CTRLB_offset = 0x11         ; LUT 2 Control B
.equ CCL_LUT2CTRLC_offset = 0x12         ; LUT 2 Control C
.equ CCL_TRUTH2_offset = 0x13            ; Truth 2
.equ CCL_LUT3CTRLA_offset = 0x14         ; LUT 3 Control A
.equ CCL_LUT3CTRLB_offset = 0x15         ; LUT 3 Control B
.equ CCL_LUT3CTRLC_offset = 0x16         ; LUT 3 Control C
.equ CCL_TRUTH3_offset = 0x17            ; Truth 3

;*************************************************************************
;** CLKCTRL - Clock controller
;*************************************************************************
.equ CLKCTRL_MCLKCTRLA_offset = 0x00     ; MCLK Control A
.equ CLKCTRL_MCLKCTRLB_offset = 0x01     ; MCLK Control B
.equ CLKCTRL_MCLKSTATUS_offset = 0x05    ; MCLK Status
.equ CLKCTRL_MCLKTIMEBASE_offset = 0x06  ; MCLK Timebase
.equ CLKCTRL_OSCHFCTRLA_offset = 0x08    ; OSCHF Control A
.equ CLKCTRL_OSCHFTUNE_offset = 0x09     ; OSCHF Tune
.equ CLKCTRL_PLLCTRLA_offset = 0x10      ; PLL Control A
.equ CLKCTRL_PLLCTRLB_offset = 0x11      ; PLL Control B
.equ CLKCTRL_OSC32KCTRLA_offset = 0x18   ; OSC32K Control A
.equ CLKCTRL_XOSC32KCTRLA_offset = 0x1C  ; XOSC32K Control A

;*************************************************************************
;** CPU - CPU
;*************************************************************************
.equ CPU_CCP_offset = 0x04               ; Configuration Change Protection
.equ CPU_SP_offset = 0x0D                ; Stack Pointer
.equ CPU_SREG_offset = 0x0F              ; Status Register

;*************************************************************************
;** CPUINT - Interrupt Controller
;*************************************************************************
.equ CPUINT_CTRLA_offset = 0x00          ; Control A
.equ CPUINT_STATUS_offset = 0x01         ; Status
.equ CPUINT_LVL0PRI_offset = 0x02        ; Interrupt Level 0 Priority
.equ CPUINT_LVL1VEC_offset = 0x03        ; Interrupt Level 1 Priority Vector

;*************************************************************************
;** CRCSCAN - CRCSCAN
;*************************************************************************
.equ CRCSCAN_CTRLA_offset = 0x00         ; Control A
.equ CRCSCAN_CTRLB_offset = 0x01         ; Control B
.equ CRCSCAN_STATUS_offset = 0x02        ; Status

;*************************************************************************
;** EVSYS - Event System
;*************************************************************************
.equ EVSYS_SWEVENTA_offset = 0x00        ; Software Event A
.equ EVSYS_CHANNEL0_offset = 0x10        ; Multiplexer Channel 0
.equ EVSYS_CHANNEL1_offset = 0x11        ; Multiplexer Channel 1
.equ EVSYS_CHANNEL2_offset = 0x12        ; Multiplexer Channel 2
.equ EVSYS_CHANNEL3_offset = 0x13        ; Multiplexer Channel 3
.equ EVSYS_CHANNEL4_offset = 0x14        ; Multiplexer Channel 4
.equ EVSYS_CHANNEL5_offset = 0x15        ; Multiplexer Channel 5
.equ EVSYS_USERCCLLUT0A_offset = 0x20    ; CCL0 Event A
.equ EVSYS_USERCCLLUT0B_offset = 0x21    ; CCL0 Event B
.equ EVSYS_USERCCLLUT1A_offset = 0x22    ; CCL1 Event A
.equ EVSYS_USERCCLLUT1B_offset = 0x23    ; CCL1 Event B
.equ EVSYS_USERCCLLUT2A_offset = 0x24    ; CCL2 Event A
.equ EVSYS_USERCCLLUT2B_offset = 0x25    ; CCL2 Event B
.equ EVSYS_USERCCLLUT3A_offset = 0x26    ; CCL3 Event A
.equ EVSYS_USERCCLLUT3B_offset = 0x27    ; CCL3 Event B
.equ EVSYS_USERADC0START_offset = 0x28   ; ADC0 Start
.equ EVSYS_USEREVSYSEVOUTA_offset = 0x29 ; EVOUTA
.equ EVSYS_USEREVSYSEVOUTC_offset = 0x2A ; EVOUTC
.equ EVSYS_USEREVSYSEVOUTD_offset = 0x2B ; EVOUTD
.equ EVSYS_USEREVSYSEVOUTF_offset = 0x2C ; EVOUTF
.equ EVSYS_USERUSART0IRDA_offset = 0x2D  ; USART0 IrDA Event
.equ EVSYS_USERTCE0CNTA_offset = 0x2E    ; TCE0 Event A
.equ EVSYS_USERTCE0CNTB_offset = 0x2F    ; TCE0 Event B
.equ EVSYS_USERTCB0CAPT_offset = 0x30    ; TCB0 Event A
.equ EVSYS_USERTCB0COUNT_offset = 0x31   ; TCB0 Event B
.equ EVSYS_USERTCB1CAPT_offset = 0x32    ; TCB1 Event A
.equ EVSYS_USERTCB1COUNT_offset = 0x33   ; TCB1 Event B
.equ EVSYS_USERTCF0CNT_offset = 0x34     ; TCF0 Clock Event
.equ EVSYS_USERTCF0ACT_offset = 0x35     ; TCF0 Action Event
.equ EVSYS_USERWEXA_offset = 0x36        ; WEX Event A
.equ EVSYS_USERWEXB_offset = 0x37        ; WEX Event B
.equ EVSYS_USERWEXC_offset = 0x38        ; WEX Event C

;*************************************************************************
;** FUSE - Fuses
;*************************************************************************
.equ FUSE_WDTCFG_offset = 0x00           ; Watchdog Configuration
.equ FUSE_BODCFG_offset = 0x01           ; BOD Configuration
.equ FUSE_OSCCFG_offset = 0x02           ; Oscillator Configuration
.equ FUSE_SYSCFG0_offset = 0x05          ; System Configuration 0
.equ FUSE_SYSCFG1_offset = 0x06          ; System Configuration 1
.equ FUSE_CODESIZE_offset = 0x07         ; Code Section Size
.equ FUSE_BOOTSIZE_offset = 0x08         ; Boot Section Size
.equ FUSE_PDICFG_offset = 0x0A           ; Programming and Debugging Interface Configuration

;*************************************************************************
;** GPR - General Purpose Registers
;*************************************************************************
.equ GPR_GPR0_offset = 0x00              ; General Purpose Register 0
.equ GPR_GPR1_offset = 0x01              ; General Purpose Register 1
.equ GPR_GPR2_offset = 0x02              ; General Purpose Register 2
.equ GPR_GPR3_offset = 0x03              ; General Purpose Register 3

;*************************************************************************
;** LOCK - Lockbits
;*************************************************************************
.equ LOCK_KEY_offset = 0x00              ; Lock Key Bits

;*************************************************************************
;** NVMCTRL - Non-volatile Memory Controller
;*************************************************************************
.equ NVMCTRL_CTRLA_offset = 0x00         ; Control A
.equ NVMCTRL_CTRLB_offset = 0x01         ; Control B
.equ NVMCTRL_CTRLC_offset = 0x02         ; Control C
.equ NVMCTRL_INTCTRL_offset = 0x04       ; Interrupt Control
.equ NVMCTRL_INTFLAGS_offset = 0x05      ; Interrupt Flags
.equ NVMCTRL_STATUS_offset = 0x06        ; Status
.equ NVMCTRL_DATA_offset = 0x08          ; Data
.equ NVMCTRL_ADDR_offset = 0x0C          ; Address

;*************************************************************************
;** PORT - I/O Ports
;*************************************************************************
.equ PORT_DIR_offset = 0x00              ; Data Direction
.equ PORT_DIRSET_offset = 0x01           ; Data Direction Set
.equ PORT_DIRCLR_offset = 0x02           ; Data Direction Clear
.equ PORT_DIRTGL_offset = 0x03           ; Data Direction Toggle
.equ PORT_OUT_offset = 0x04              ; Output Value
.equ PORT_OUTSET_offset = 0x05           ; Output Value Set
.equ PORT_OUTCLR_offset = 0x06           ; Output Value Clear
.equ PORT_OUTTGL_offset = 0x07           ; Output Value Toggle
.equ PORT_IN_offset = 0x08               ; Input Value
.equ PORT_INTFLAGS_offset = 0x09         ; Interrupt Flags
.equ PORT_PORTCTRL_offset = 0x0A         ; Port Control
.equ PORT_PINCONFIG_offset = 0x0B        ; Pin Control Config
.equ PORT_PINCTRLUPD_offset = 0x0C       ; Pin Control Update
.equ PORT_PINCTRLSET_offset = 0x0D       ; Pin Control Set
.equ PORT_PINCTRLCLR_offset = 0x0E       ; Pin Control Clear
.equ PORT_PIN0CTRL_offset = 0x10         ; Pin 0 Control
.equ PORT_PIN1CTRL_offset = 0x11         ; Pin 1 Control
.equ PORT_PIN2CTRL_offset = 0x12         ; Pin 2 Control
.equ PORT_PIN3CTRL_offset = 0x13         ; Pin 3 Control
.equ PORT_PIN4CTRL_offset = 0x14         ; Pin 4 Control
.equ PORT_PIN5CTRL_offset = 0x15         ; Pin 5 Control
.equ PORT_PIN6CTRL_offset = 0x16         ; Pin 6 Control
.equ PORT_PIN7CTRL_offset = 0x17         ; Pin 7 Control
.equ PORT_EVGENCTRLA_offset = 0x18       ; Event Generation Control A

;*************************************************************************
;** PORTMUX - Port Multiplexer
;*************************************************************************
.equ PORTMUX_EVSYSROUTEA_offset = 0x00   ; EVSYS route A
.equ PORTMUX_CCLROUTEA_offset = 0x01     ; CCL route A
.equ PORTMUX_USARTROUTEA_offset = 0x02   ; USART route A
.equ PORTMUX_SPIROUTEA_offset = 0x05     ; SPI route A
.equ PORTMUX_TWIROUTEA_offset = 0x06     ; TWI route A
.equ PORTMUX_TCEROUTEA_offset = 0x07     ; TCE route A
.equ PORTMUX_TCBROUTEA_offset = 0x08     ; TCB route A
.equ PORTMUX_TCFROUTEA_offset = 0x0C     ; TCF Route A

;*************************************************************************
;** RSTCTRL - Reset controller
;*************************************************************************
.equ RSTCTRL_RSTFR_offset = 0x00         ; Reset Flags
.equ RSTCTRL_SWRR_offset = 0x01          ; Software Reset

;*************************************************************************
;** RTC - Real-Time Counter
;*************************************************************************
.equ RTC_CTRLA_offset = 0x00             ; Control A
.equ RTC_STATUS_offset = 0x01            ; Status
.equ RTC_INTCTRL_offset = 0x02           ; Interrupt Control
.equ RTC_INTFLAGS_offset = 0x03          ; Interrupt Flags
.equ RTC_TEMP_offset = 0x04              ; Temporary
.equ RTC_DBGCTRL_offset = 0x05           ; Debug control
.equ RTC_CALIB_offset = 0x06             ; Calibration
.equ RTC_CLKSEL_offset = 0x07            ; Clock Select
.equ RTC_CNT_offset = 0x08               ; Counter
.equ RTC_PER_offset = 0x0A               ; Period
.equ RTC_CMP_offset = 0x0C               ; Compare
.equ RTC_PITCTRLA_offset = 0x10          ; PIT Control A
.equ RTC_PITSTATUS_offset = 0x11         ; PIT Status
.equ RTC_PITINTCTRL_offset = 0x12        ; PIT Interrupt Control
.equ RTC_PITINTFLAGS_offset = 0x13       ; PIT Interrupt Flags
.equ RTC_PITDBGCTRL_offset = 0x15        ; PIT Debug control
.equ RTC_PITEVGENCTRLA_offset = 0x16     ; PIT Event Generation Control A

;*************************************************************************
;** SIGROW - Signature row
;*************************************************************************
.equ SIGROW_DEVICEID0_offset = 0x00      ; Device ID Byte 0
.equ SIGROW_DEVICEID1_offset = 0x01      ; Device ID Byte 1
.equ SIGROW_DEVICEID2_offset = 0x02      ; Device ID Byte 2
.equ SIGROW_TEMPSENSE0_offset = 0x04     ; Temperature Calibration 0
.equ SIGROW_TEMPSENSE1_offset = 0x06     ; Temperature Calibration 1
.equ SIGROW_SERNUM0_offset = 0x10        ; Serial Number Byte 0
.equ SIGROW_SERNUM1_offset = 0x11        ; Serial Number Byte 1
.equ SIGROW_SERNUM2_offset = 0x12        ; Serial Number Byte 2
.equ SIGROW_SERNUM3_offset = 0x13        ; Serial Number Byte 3
.equ SIGROW_SERNUM4_offset = 0x14        ; Serial Number Byte 4
.equ SIGROW_SERNUM5_offset = 0x15        ; Serial Number Byte 5
.equ SIGROW_SERNUM6_offset = 0x16        ; Serial Number Byte 6
.equ SIGROW_SERNUM7_offset = 0x17        ; Serial Number Byte 7
.equ SIGROW_SERNUM8_offset = 0x18        ; Serial Number Byte 8
.equ SIGROW_SERNUM9_offset = 0x19        ; Serial Number Byte 9
.equ SIGROW_SERNUM10_offset = 0x1A       ; Serial Number Byte 10
.equ SIGROW_SERNUM11_offset = 0x1B       ; Serial Number Byte 11
.equ SIGROW_SERNUM12_offset = 0x1C       ; Serial Number Byte 12
.equ SIGROW_SERNUM13_offset = 0x1D       ; Serial Number Byte 13
.equ SIGROW_SERNUM14_offset = 0x1E       ; Serial Number Byte 14
.equ SIGROW_SERNUM15_offset = 0x1F       ; Serial Number Byte 15

;*************************************************************************
;** SLPCTRL - Sleep Controller
;*************************************************************************
.equ SLPCTRL_CTRLA_offset = 0x00         ; Control A

;*************************************************************************
;** SPI - Serial Peripheral Interface
;*************************************************************************
.equ SPI_CTRLA_offset = 0x00             ; Control A
.equ SPI_CTRLB_offset = 0x01             ; Control B
.equ SPI_INTCTRL_offset = 0x02           ; Interrupt Control
.equ SPI_INTFLAGS_offset = 0x03          ; Interrupt Flags
.equ SPI_DATA_offset = 0x04              ; Data

;*************************************************************************
;** SYSCFG - System Configuration Registers
;*************************************************************************
.equ SYSCFG_REVID_offset = 0x01          ; Revision ID

;*************************************************************************
;** TCB - 16-bit Timer/Counter Type B
;*************************************************************************
.equ TCB_CTRLA_offset = 0x00             ; Control A
.equ TCB_CTRLB_offset = 0x01             ; Control B
.equ TCB_CTRLC_offset = 0x02             ; Control C
.equ TCB_EVCTRL_offset = 0x04            ; Event Control
.equ TCB_INTCTRL_offset = 0x05           ; Interrupt Control
.equ TCB_INTFLAGS_offset = 0x06          ; Interrupt Flags
.equ TCB_STATUS_offset = 0x07            ; Status
.equ TCB_DBGCTRL_offset = 0x08           ; Debug Control
.equ TCB_TEMP_offset = 0x09              ; Temporary Value
.equ TCB_CNT_offset = 0x0A               ; Count
.equ TCB_CCMP_offset = 0x0C              ; Compare or Capture

