QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
;*************************************************************************
;** TCE - 16-bit Timer/Counter Type E
;*************************************************************************
.equ TCE_CTRLA_offset = 0x00             ; Control A
.equ TCE_CTRLB_offset = 0x01             ; Control B
.equ TCE_CTRLC_offset = 0x02             ; Control C
.equ TCE_CTRLD_offset = 0x03             ; Control D
.equ TCE_CTRLECLR_offset = 0x04          ; Control E Clear
.equ TCE_CTRLESET_offset = 0x05          ; Control E Set
.equ TCE_CTRLFCLR_offset = 0x06          ; Control F Clear
.equ TCE_CTRLFSET_offset = 0x07          ; Control F Set
.equ TCE_EVGENCTRL_offset = 0x08         ; Event Generation Control
.equ TCE_EVCTRL_offset = 0x09            ; Event Control
.equ TCE_INTCTRL_offset = 0x0A           ; Interrupt Control
.equ TCE_INTFLAGS_offset = 0x0B          ; Interrupt Flags
.equ TCE_DBGCTRL_offset = 0x0E           ; Debug Control
.equ TCE_TEMP_offset = 0x0F              ; Temporary data for 16-bit Access
.equ TCE_CNT_offset = 0x20               ; Count
.equ TCE_AMP_offset = 0x22               ; Amplitude
.equ TCE_OFFSET_offset = 0x24            ; Offset
.equ TCE_PER_offset = 0x26               ; Period
.equ TCE_CMP0_offset = 0x28              ; Compare 0
.equ TCE_CMP1_offset = 0x2A              ; Compare 1
.equ TCE_CMP2_offset = 0x2C              ; Compare 2
.equ TCE_CMP3_offset = 0x2E              ; Compare 3
.equ TCE_PERBUF_offset = 0x36            ; Period Buffer
.equ TCE_CMP0BUF_offset = 0x38           ; Compare 0 Buffer
.equ TCE_CMP1BUF_offset = 0x3A           ; Compare 1 Buffer
.equ TCE_CMP2BUF_offset = 0x3C           ; Compare 2 Buffer
.equ TCE_CMP3BUF_offset = 0x3E           ; Compare 3 Buffer

;*************************************************************************
;** TCF - 24-bit Timer/Counter for frequency generation
;*************************************************************************
.equ TCF_CTRLA_offset = 0x00             ; Control A
.equ TCF_CTRLB_offset = 0x01             ; Control B
.equ TCF_CTRLC_offset = 0x02             ; Control C
.equ TCF_CTRLD_offset = 0x03             ; Control D
.equ TCF_EVCTRL_offset = 0x04            ; Event Control
.equ TCF_INTCTRL_offset = 0x05           ; Interrupt Control
.equ TCF_INTFLAGS_offset = 0x06          ; Interrupt Flags
.equ TCF_STATUS_offset = 0x07            ; Status
.equ TCF_DBGCTRL_offset = 0x0D           ; Debug Control
.equ TCF_CNT_offset = 0x10               ; Count
.equ TCF_CMP_offset = 0x14               ; Compare

;*************************************************************************
;** TWI - Two-Wire Interface
;*************************************************************************
.equ TWI_CTRLA_offset = 0x00             ; Control A
.equ TWI_DUALCTRL_offset = 0x01          ; Dual Mode Control
.equ TWI_DBGCTRL_offset = 0x02           ; Debug Control
.equ TWI_MCTRLA_offset = 0x03            ; Host Control A
.equ TWI_MCTRLB_offset = 0x04            ; Host Control B
.equ TWI_MSTATUS_offset = 0x05           ; Host STATUS
.equ TWI_MBAUD_offset = 0x06             ; Host Baud Rate
.equ TWI_MADDR_offset = 0x07             ; Host Address
.equ TWI_MDATA_offset = 0x08             ; Host Data
.equ TWI_SCTRLA_offset = 0x09            ; Client Control A
.equ TWI_SCTRLB_offset = 0x0A            ; Client Control B
.equ TWI_SSTATUS_offset = 0x0B           ; Client Status
.equ TWI_SADDR_offset = 0x0C             ; Client Address
.equ TWI_SDATA_offset = 0x0D             ; Client Data
.equ TWI_SADDRMASK_offset = 0x0E         ; Client Address Mask

;*************************************************************************
;** USART - Universal Synchronous and Asynchronous Receiver and Transmitter
;*************************************************************************
.equ USART_RXDATAL_offset = 0x00         ; Receive Data Low Byte
.equ USART_RXDATAH_offset = 0x01         ; Receive Data High Byte
.equ USART_TXDATAL_offset = 0x02         ; Transmit Data Low Byte
.equ USART_TXDATAH_offset = 0x03         ; Transmit Data High Byte
.equ USART_STATUS_offset = 0x04          ; Status
.equ USART_CTRLA_offset = 0x05           ; Control A
.equ USART_CTRLB_offset = 0x06           ; Control B
.equ USART_CTRLC_offset = 0x07           ; Control C
.equ USART_BAUD_offset = 0x08            ; Baud Rate
.equ USART_CTRLD_offset = 0x0A           ; Control D
.equ USART_DBGCTRL_offset = 0x0B         ; Debug Control
.equ USART_EVCTRL_offset = 0x0C          ; Event Control
.equ USART_TXPLCTRL_offset = 0x0D        ; IRCOM Transmitter Pulse Length Control
.equ USART_RXPLCTRL_offset = 0x0E        ; IRCOM Receiver Pulse Length Control

;*************************************************************************
;** USERROW - User Row
;*************************************************************************
.equ USERROW_USERROW0_offset = 0x00      ; User Row Byte 0
.equ USERROW_USERROW1_offset = 0x01      ; User Row Byte 1
.equ USERROW_USERROW2_offset = 0x02      ; User Row Byte 2
.equ USERROW_USERROW3_offset = 0x03      ; User Row Byte 3
.equ USERROW_USERROW4_offset = 0x04      ; User Row Byte 4
.equ USERROW_USERROW5_offset = 0x05      ; User Row Byte 5
.equ USERROW_USERROW6_offset = 0x06      ; User Row Byte 6
.equ USERROW_USERROW7_offset = 0x07      ; User Row Byte 7
.equ USERROW_USERROW8_offset = 0x08      ; User Row Byte 8
.equ USERROW_USERROW9_offset = 0x09      ; User Row Byte 9
.equ USERROW_USERROW10_offset = 0x0A     ; User Row Byte 10
.equ USERROW_USERROW11_offset = 0x0B     ; User Row Byte 11
.equ USERROW_USERROW12_offset = 0x0C     ; User Row Byte 12
.equ USERROW_USERROW13_offset = 0x0D     ; User Row Byte 13
.equ USERROW_USERROW14_offset = 0x0E     ; User Row Byte 14
.equ USERROW_USERROW15_offset = 0x0F     ; User Row Byte 15
.equ USERROW_USERROW16_offset = 0x10     ; User Row Byte 16
.equ USERROW_USERROW17_offset = 0x11     ; User Row Byte 17
.equ USERROW_USERROW18_offset = 0x12     ; User Row Byte 18
.equ USERROW_USERROW19_offset = 0x13     ; User Row Byte 19
.equ USERROW_USERROW20_offset = 0x14     ; User Row Byte 20
.equ USERROW_USERROW21_offset = 0x15     ; User Row Byte 21
.equ USERROW_USERROW22_offset = 0x16     ; User Row Byte 22
.equ USERROW_USERROW23_offset = 0x17     ; User Row Byte 23
.equ USERROW_USERROW24_offset = 0x18     ; User Row Byte 24
.equ USERROW_USERROW25_offset = 0x19     ; User Row Byte 25
.equ USERROW_USERROW26_offset = 0x1A     ; User Row Byte 26
.equ USERROW_USERROW27_offset = 0x1B     ; User Row Byte 27
.equ USERROW_USERROW28_offset = 0x1C     ; User Row Byte 28
.equ USERROW_USERROW29_offset = 0x1D     ; User Row Byte 29
.equ USERROW_USERROW30_offset = 0x1E     ; User Row Byte 30
.equ USERROW_USERROW31_offset = 0x1F     ; User Row Byte 31
.equ USERROW_USERROW32_offset = 0x20     ; User Row Byte 32
.equ USERROW_USERROW33_offset = 0x21     ; User Row Byte 33
.equ USERROW_USERROW34_offset = 0x22     ; User Row Byte 34
.equ USERROW_USERROW35_offset = 0x23     ; User Row Byte 35
.equ USERROW_USERROW36_offset = 0x24     ; User Row Byte 36
.equ USERROW_USERROW37_offset = 0x25     ; User Row Byte 37
.equ USERROW_USERROW38_offset = 0x26     ; User Row Byte 38
.equ USERROW_USERROW39_offset = 0x27     ; User Row Byte 39
.equ USERROW_USERROW40_offset = 0x28     ; User Row Byte 40
.equ USERROW_USERROW41_offset = 0x29     ; User Row Byte 41
.equ USERROW_USERROW42_offset = 0x2A     ; User Row Byte 42
.equ USERROW_USERROW43_offset = 0x2B     ; User Row Byte 43
.equ USERROW_USERROW44_offset = 0x2C     ; User Row Byte 44
.equ USERROW_USERROW45_offset = 0x2D     ; User Row Byte 45
.equ USERROW_USERROW46_offset = 0x2E     ; User Row Byte 46
.equ USERROW_USERROW47_offset = 0x2F     ; User Row Byte 47
.equ USERROW_USERROW48_offset = 0x30     ; User Row Byte 48
.equ USERROW_USERROW49_offset = 0x31     ; User Row Byte 49
.equ USERROW_USERROW50_offset = 0x32     ; User Row Byte 50
.equ USERROW_USERROW51_offset = 0x33     ; User Row Byte 51
.equ USERROW_USERROW52_offset = 0x34     ; User Row Byte 52
.equ USERROW_USERROW53_offset = 0x35     ; User Row Byte 53
.equ USERROW_USERROW54_offset = 0x36     ; User Row Byte 54
.equ USERROW_USERROW55_offset = 0x37     ; User Row Byte 55
.equ USERROW_USERROW56_offset = 0x38     ; User Row Byte 56
.equ USERROW_USERROW57_offset = 0x39     ; User Row Byte 57
.equ USERROW_USERROW58_offset = 0x3A     ; User Row Byte 58
.equ USERROW_USERROW59_offset = 0x3B     ; User Row Byte 59
.equ USERROW_USERROW60_offset = 0x3C     ; User Row Byte 60
.equ USERROW_USERROW61_offset = 0x3D     ; User Row Byte 61
.equ USERROW_USERROW62_offset = 0x3E     ; User Row Byte 62
.equ USERROW_USERROW63_offset = 0x3F     ; User Row Byte 63

;*************************************************************************
;** VPORT - Virtual Ports
;*************************************************************************
.equ VPORT_DIR_offset = 0x00             ; Data Direction
.equ VPORT_OUT_offset = 0x01             ; Output Value
.equ VPORT_IN_offset = 0x02              ; Input Value
.equ VPORT_INTFLAGS_offset = 0x03        ; Interrupt Flags

;*************************************************************************
;** VREF - Voltage reference
;*************************************************************************
.equ VREF_DAC0REF_offset = 0x02          ; DAC0 Reference
.equ VREF_ACREF_offset = 0x04            ; AC Reference

;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************
.equ WDT_CTRLA_offset = 0x00             ; Control A
.equ WDT_STATUS_offset = 0x01            ; Status

;*************************************************************************
;** WEX - Waveform Extension
;*************************************************************************
.equ WEX_CTRLA_offset = 0x00             ; Control A
.equ WEX_CTRLB_offset = 0x01             ; Control B
.equ WEX_CTRLC_offset = 0x02             ; Control C
.equ WEX_EVCTRLA_offset = 0x04           ; Event Control A
.equ WEX_EVCTRLB_offset = 0x05           ; Event Control B
.equ WEX_EVCTRLC_offset = 0x06           ; Event Control C
.equ WEX_BUFCTRL_offset = 0x07           ; Buffer Valid Control
.equ WEX_BLANKCTRL_offset = 0x08         ; Blanking Control
.equ WEX_BLANKTIME_offset = 0x09         ; Blanking Time
.equ WEX_FAULTCTRL_offset = 0x0A         ; Fault Control
.equ WEX_FAULTDRV_offset = 0x0B          ; Fault Drive
.equ WEX_FAULTOUT_offset = 0x0C          ; Fault Output
.equ WEX_INTCTRL_offset = 0x0D           ; Interrupt Control
.equ WEX_INTFLAGS_offset = 0x0E          ; Interrupt Flags
.equ WEX_STATUS_offset = 0x0F            ; Status
.equ WEX_DTLS_offset = 0x10              ; Dead-time Low Side
.equ WEX_DTHS_offset = 0x11              ; Dead-time High Side
.equ WEX_DTBOTH_offset = 0x12            ; Dead-time Both Sides
.equ WEX_SWAP_offset = 0x13              ; DTI Swap
.equ WEX_PGMOVR_offset = 0x14            ; Pattern Generation Override
.equ WEX_PGMOUT_offset = 0x15            ; Pattern Generation Output
.equ WEX_OUTOVEN_offset = 0x17           ; Output Override Enable
.equ WEX_DTLSBUF_offset = 0x18           ; Dead-time Low Side Buffer
.equ WEX_DTHSBUF_offset = 0x19           ; Dead-time High Side Buffer
.equ WEX_DTBOTHBUF_offset = 0x1A         ; Dead-time Both Sides Buffer
.equ WEX_SWAPBUF_offset = 0x1B           ; DTI Swap Buffer
.equ WEX_PGMOVRBUF_offset = 0x1C         ; Pattern Generation Override Buffer
.equ WEX_PGMOUTBUF_offset = 0x1D         ; Pattern Generation Output Buffer


; ***** LOCKBIT REGISTER LOCATIONS ***************************************




; ***** FUSE REGISTER LOCATIONS ******************************************




