QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
; FUSE_BODCFG masks
.equ FUSE_SLEEP_gm = 0x03                ; BOD Operation in Sleep Mode group mask
.equ FUSE_SLEEP_gp = 0                   ; BOD Operation in Sleep Mode group position
.equ FUSE_SLEEP_0_bm = (1<<0)            ; BOD Operation in Sleep Mode bit 0 mask
.equ FUSE_SLEEP_0_bp = 0                 ; BOD Operation in Sleep Mode bit 0 position
.equ FUSE_SLEEP_1_bm = (1<<1)            ; BOD Operation in Sleep Mode bit 1 mask
.equ FUSE_SLEEP_1_bp = 1                 ; BOD Operation in Sleep Mode bit 1 position
.equ FUSE_ACTIVE_gm = 0x0C               ; BOD Operation in Active Mode group mask
.equ FUSE_ACTIVE_gp = 2                  ; BOD Operation in Active Mode group position
.equ FUSE_ACTIVE_0_bm = (1<<2)           ; BOD Operation in Active Mode bit 0 mask
.equ FUSE_ACTIVE_0_bp = 2                ; BOD Operation in Active Mode bit 0 position
.equ FUSE_ACTIVE_1_bm = (1<<3)           ; BOD Operation in Active Mode bit 1 mask
.equ FUSE_ACTIVE_1_bp = 3                ; BOD Operation in Active Mode bit 1 position
.equ FUSE_SAMPFREQ_bm = 0x10             ; BOD Sample Frequency bit mask
.equ FUSE_SAMPFREQ_bp = 4                ; BOD Sample Frequency bit position
.equ FUSE_LVL_gm = 0xE0                  ; BOD Level group mask
.equ FUSE_LVL_gp = 5                     ; BOD Level group position
.equ FUSE_LVL_0_bm = (1<<5)              ; BOD Level bit 0 mask
.equ FUSE_LVL_0_bp = 5                   ; BOD Level bit 0 position
.equ FUSE_LVL_1_bm = (1<<6)              ; BOD Level bit 1 mask
.equ FUSE_LVL_1_bp = 6                   ; BOD Level bit 1 position
.equ FUSE_LVL_2_bm = (1<<7)              ; BOD Level bit 2 mask
.equ FUSE_LVL_2_bp = 7                   ; BOD Level bit 2 position

; FUSE_OSCCFG masks
.equ FUSE_OSCHFFRQ_bm = 0x08             ; High-frequency Oscillator Frequency bit mask
.equ FUSE_OSCHFFRQ_bp = 3                ; High-frequency Oscillator Frequency bit position

; FUSE_SYSCFG0 masks
.equ FUSE_EESAVE_bm = 0x01               ; EEPROM Save bit mask
.equ FUSE_EESAVE_bp = 0                  ; EEPROM Save bit position
.equ FUSE_RSTPINCFG_bm = 0x08            ; Reset Pin Configuration bit mask
.equ FUSE_RSTPINCFG_bp = 3               ; Reset Pin Configuration bit position
.equ FUSE_UPDIPINCFG_bm = 0x10           ; UPDI Pin Configuration bit mask
.equ FUSE_UPDIPINCFG_bp = 4              ; UPDI Pin Configuration bit position
.equ FUSE_CRCSEL_bm = 0x20               ; CRC Select bit mask
.equ FUSE_CRCSEL_bp = 5                  ; CRC Select bit position
.equ FUSE_CRCSRC_gm = 0xC0               ; CRC Source group mask
.equ FUSE_CRCSRC_gp = 6                  ; CRC Source group position
.equ FUSE_CRCSRC_0_bm = (1<<6)           ; CRC Source bit 0 mask
.equ FUSE_CRCSRC_0_bp = 6                ; CRC Source bit 0 position
.equ FUSE_CRCSRC_1_bm = (1<<7)           ; CRC Source bit 1 mask
.equ FUSE_CRCSRC_1_bp = 7                ; CRC Source bit 1 position

; FUSE_SYSCFG1 masks
.equ FUSE_SUT_gm = 0x07                  ; Startup Time group mask
.equ FUSE_SUT_gp = 0                     ; Startup Time group position
.equ FUSE_SUT_0_bm = (1<<0)              ; Startup Time bit 0 mask
.equ FUSE_SUT_0_bp = 0                   ; Startup Time bit 0 position
.equ FUSE_SUT_1_bm = (1<<1)              ; Startup Time bit 1 mask
.equ FUSE_SUT_1_bp = 1                   ; Startup Time bit 1 position
.equ FUSE_SUT_2_bm = (1<<2)              ; Startup Time bit 2 mask
.equ FUSE_SUT_2_bp = 2                   ; Startup Time bit 2 position

; FUSE_PDICFG masks
.equ FUSE_LEVEL_gm = 0x03                ; Protection Level group mask
.equ FUSE_LEVEL_gp = 0                   ; Protection Level group position
.equ FUSE_LEVEL_0_bm = (1<<0)            ; Protection Level bit 0 mask
.equ FUSE_LEVEL_0_bp = 0                 ; Protection Level bit 0 position
.equ FUSE_LEVEL_1_bm = (1<<1)            ; Protection Level bit 1 mask
.equ FUSE_LEVEL_1_bp = 1                 ; Protection Level bit 1 position
.equ FUSE_KEY_gm = 0xFFF0                ; NVM Protection Activation Key group mask
.equ FUSE_KEY_gp = 4                     ; NVM Protection Activation Key group position
.equ FUSE_KEY_0_bm = (1<<4)              ; NVM Protection Activation Key bit 0 mask
.equ FUSE_KEY_0_bp = 4                   ; NVM Protection Activation Key bit 0 position
.equ FUSE_KEY_1_bm = (1<<5)              ; NVM Protection Activation Key bit 1 mask
.equ FUSE_KEY_1_bp = 5                   ; NVM Protection Activation Key bit 1 position
.equ FUSE_KEY_2_bm = (1<<6)              ; NVM Protection Activation Key bit 2 mask
.equ FUSE_KEY_2_bp = 6                   ; NVM Protection Activation Key bit 2 position
.equ FUSE_KEY_3_bm = (1<<7)              ; NVM Protection Activation Key bit 3 mask
.equ FUSE_KEY_3_bp = 7                   ; NVM Protection Activation Key bit 3 position
.equ FUSE_KEY_4_bm = (1<<8)              ; NVM Protection Activation Key bit 4 mask
.equ FUSE_KEY_4_bp = 8                   ; NVM Protection Activation Key bit 4 position
.equ FUSE_KEY_5_bm = (1<<9)              ; NVM Protection Activation Key bit 5 mask
.equ FUSE_KEY_5_bp = 9                   ; NVM Protection Activation Key bit 5 position
.equ FUSE_KEY_6_bm = (1<<10)             ; NVM Protection Activation Key bit 6 mask
.equ FUSE_KEY_6_bp = 10                  ; NVM Protection Activation Key bit 6 position
.equ FUSE_KEY_7_bm = (1<<11)             ; NVM Protection Activation Key bit 7 mask
.equ FUSE_KEY_7_bp = 11                  ; NVM Protection Activation Key bit 7 position
.equ FUSE_KEY_8_bm = (1<<12)             ; NVM Protection Activation Key bit 8 mask
.equ FUSE_KEY_8_bp = 12                  ; NVM Protection Activation Key bit 8 position
.equ FUSE_KEY_9_bm = (1<<13)             ; NVM Protection Activation Key bit 9 mask
.equ FUSE_KEY_9_bp = 13                  ; NVM Protection Activation Key bit 9 position
.equ FUSE_KEY_10_bm = (1<<14)            ; NVM Protection Activation Key bit 10 mask
.equ FUSE_KEY_10_bp = 14                 ; NVM Protection Activation Key bit 10 position
.equ FUSE_KEY_11_bm = (1<<15)            ; NVM Protection Activation Key bit 11 mask
.equ FUSE_KEY_11_bp = 15                 ; NVM Protection Activation Key bit 11 position

