QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
; TCE_DBGCTRL masks
.equ TCE_DBGRUN_bm = 0x01                ; Debug Run bit mask
.equ TCE_DBGRUN_bp = 0                   ; Debug Run bit position

; Clock Selection
.equ TCE_CLKSEL_DIV1_gc = (0x00<<1)      ; System Clock
.equ TCE_CLKSEL_DIV2_gc = (0x01<<1)      ; System Clock / 2
.equ TCE_CLKSEL_DIV4_gc = (0x02<<1)      ; System Clock / 4
.equ TCE_CLKSEL_DIV8_gc = (0x03<<1)      ; System Clock / 8
.equ TCE_CLKSEL_DIV16_gc = (0x04<<1)     ; System Clock / 16
.equ TCE_CLKSEL_DIV64_gc = (0x05<<1)     ; System Clock / 64
.equ TCE_CLKSEL_DIV256_gc = (0x06<<1)    ; System Clock / 256
.equ TCE_CLKSEL_DIV1024_gc = (0x07<<1)   ; System Clock / 1024

; Waveform generation mode select
.equ TCE_WGMODE_NORMAL_gc = (0x00<<0)    ; Normal Mode
.equ TCE_WGMODE_FRQ_gc = (0x01<<0)       ; Frequency Generation Mode
.equ TCE_WGMODE_SINGLESLOPE_gc = (0x03<<0) ; Single Slope PWM
.equ TCE_WGMODE_DSTOP_gc = (0x05<<0)     ; Dual Slope PWM, overflow on TOP
.equ TCE_WGMODE_DSBOTH_gc = (0x06<<0)    ; Dual Slope PWM, overflow on TOP and BOTTOM
.equ TCE_WGMODE_DSBOTTOM_gc = (0x07<<0)  ; Dual Slope PWM, overflow on BOTTOM

; High Resolution Enable select
.equ TCE_HREN_OFF_gc = (0x00<<6)         ; High Resolution Disable
.equ TCE_HREN_4X_gc = (0x01<<6)          ; Resolution increased by 4 (2 bits)
.equ TCE_HREN_8X_gc = (0x02<<6)          ; Resolution increased by 4 (3 bits)

; Scaled Write select
.equ TCE_SCALE_NORMAL_gc = (0x00<<2)     ; Absolute values used when writing to CMPn, CMPnBUF and registers
.equ TCE_SCALE_FRACTIONAL_gc = (0x01<<2) ; Fractional values used when writing to CMPn, CMPnBUF and registers

; Scaling Mode select
.equ TCE_SCALEMODE_CENTER_gc = (0x00<<4) ; CMPn registers scaled vs center (50% duty cycle)
.equ TCE_SCALEMODE_BOTTOM_gc = (0x01<<4) ; CMPn registers scaled vs BOTTOM (0% duty cycle)
.equ TCE_SCALEMODE_TOP_gc = (0x02<<4)    ; CMPn registers scaled vs TOP (100% duty cycle)
.equ TCE_SCALEMODE_TOPBOTTOM_gc = (0x03<<4) ; CMPn registers scaled vs TOP or BOTTOM depending on written value.

; Command select
.equ TCE_CMD_NONE_gc = (0x00<<2)         ; No Command
.equ TCE_CMD_UPDATE_gc = (0x01<<2)       ; Force Update
.equ TCE_CMD_RESTART_gc = (0x02<<2)      ; Force Restart
.equ TCE_CMD_RESET_gc = (0x03<<2)        ; Force Hard Reset

; Direction select
.equ TCE_DIR_UP_gc = (0x00<<0)           ; Count up
.equ TCE_DIR_DOWN_gc = (0x01<<0)         ; Count down

; Event Action A select
.equ TCE_EVACTA_CNT_POSEDGE_gc = (0x00<<1) ; Count on positive edge event
.equ TCE_EVACTA_CNT_ANYEDGE_gc = (0x01<<1) ; Count on any edge event
.equ TCE_EVACTA_CNT_HIGHLVL_gc = (0x02<<1) ; Count on prescaled clock while event line is 1.
.equ TCE_EVACTA_UPDOWN_gc = (0x03<<1)    ; Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1.

; Event Action B select
.equ TCE_EVACTB_NONE_gc = (0x00<<5)      ; No Action
.equ TCE_EVACTB_UPDOWN_gc = (0x03<<5)    ; Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1.
.equ TCE_EVACTB_RESTART_POSEDGE_gc = (0x04<<5) ; Restart counter at positive edge event
.equ TCE_EVACTB_RESTART_ANYEDGE_gc = (0x05<<5) ; Restart counter on any edge event
.equ TCE_EVACTB_RESTART_HIGHLVL_gc = (0x06<<5) ; Restart counter while event line is 1.

; Compare # Event select
.equ TCE_CMP3EV_PULSE_gc = (0x00<<7)     ; Event output for CMP is a pulse
.equ TCE_CMP3EV_WAVEFORM_gc = (0x01<<7)  ; Event output for CMP is equal to waveform


;*************************************************************************
;** TCF - 24-bit Timer/Counter for frequency generation
;*************************************************************************

; TCF_CTRLA masks
.equ TCF_ENABLE_bm = 0x01                ; Enable bit mask
.equ TCF_ENABLE_bp = 0                   ; Enable bit position
.equ TCF_PRESC_gm = 0x0E                 ; Clock Prescaler group mask
.equ TCF_PRESC_gp = 1                    ; Clock Prescaler group position
.equ TCF_PRESC_0_bm = (1<<1)             ; Clock Prescaler bit 0 mask
.equ TCF_PRESC_0_bp = 1                  ; Clock Prescaler bit 0 position
.equ TCF_PRESC_1_bm = (1<<2)             ; Clock Prescaler bit 1 mask
.equ TCF_PRESC_1_bp = 2                  ; Clock Prescaler bit 1 position
.equ TCF_PRESC_2_bm = (1<<3)             ; Clock Prescaler bit 2 mask
.equ TCF_PRESC_2_bp = 3                  ; Clock Prescaler bit 2 position
.equ TCF_RUNSTDBY_bm = 0x80              ; Run Standby bit mask
.equ TCF_RUNSTDBY_bp = 7                 ; Run Standby bit position

; TCF_CTRLB masks
.equ TCF_WGMODE_gm = 0x07                ; Waveform Generation Mode group mask
.equ TCF_WGMODE_gp = 0                   ; Waveform Generation Mode group position
.equ TCF_WGMODE_0_bm = (1<<0)            ; Waveform Generation Mode bit 0 mask
.equ TCF_WGMODE_0_bp = 0                 ; Waveform Generation Mode bit 0 position
.equ TCF_WGMODE_1_bm = (1<<1)            ; Waveform Generation Mode bit 1 mask
.equ TCF_WGMODE_1_bp = 1                 ; Waveform Generation Mode bit 1 position
.equ TCF_WGMODE_2_bm = (1<<2)            ; Waveform Generation Mode bit 2 mask
.equ TCF_WGMODE_2_bp = 2                 ; Waveform Generation Mode bit 2 position
.equ TCF_CLKSEL_gm = 0x38                ; Clock Select group mask
.equ TCF_CLKSEL_gp = 3                   ; Clock Select group position
.equ TCF_CLKSEL_0_bm = (1<<3)            ; Clock Select bit 0 mask
.equ TCF_CLKSEL_0_bp = 3                 ; Clock Select bit 0 position
.equ TCF_CLKSEL_1_bm = (1<<4)            ; Clock Select bit 1 mask
.equ TCF_CLKSEL_1_bp = 4                 ; Clock Select bit 1 position
.equ TCF_CLKSEL_2_bm = (1<<5)            ; Clock Select bit 2 mask
.equ TCF_CLKSEL_2_bp = 5                 ; Clock Select bit 2 position
.equ TCF_CMP0EV_bm = 0x40                ; Compare 0 Event Generation bit mask
.equ TCF_CMP0EV_bp = 6                   ; Compare 0 Event Generation bit position
.equ TCF_CMP1EV_bm = 0x80                ; Compare 1 Event Generation bit mask
.equ TCF_CMP1EV_bp = 7                   ; Compare 1 Event Generation bit position

