QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
; VREF_ACREF masks
; Masks for VREF_REFSEL already defined
; Masks for VREF_ALWAYSON already defined

; Reference select
.equ VREF_REFSEL_1V024_gc = (0x00<<0)    ; Internal 1.024V reference
.equ VREF_REFSEL_2V048_gc = (0x01<<0)    ; Internal 2.048V reference
.equ VREF_REFSEL_4V096_gc = (0x02<<0)    ; Internal 4.096V reference
.equ VREF_REFSEL_2V500_gc = (0x03<<0)    ; Internal 2.500V reference
.equ VREF_REFSEL_VDD_gc = (0x05<<0)      ; VDD as reference
.equ VREF_REFSEL_VREFA_gc = (0x06<<0)    ; External reference on VREFA pin


;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

; WDT_CTRLA masks
.equ WDT_PERIOD_gm = 0x0F                ; Period group mask
.equ WDT_PERIOD_gp = 0                   ; Period group position
.equ WDT_PERIOD_0_bm = (1<<0)            ; Period bit 0 mask
.equ WDT_PERIOD_0_bp = 0                 ; Period bit 0 position
.equ WDT_PERIOD_1_bm = (1<<1)            ; Period bit 1 mask
.equ WDT_PERIOD_1_bp = 1                 ; Period bit 1 position
.equ WDT_PERIOD_2_bm = (1<<2)            ; Period bit 2 mask
.equ WDT_PERIOD_2_bp = 2                 ; Period bit 2 position
.equ WDT_PERIOD_3_bm = (1<<3)            ; Period bit 3 mask
.equ WDT_PERIOD_3_bp = 3                 ; Period bit 3 position
.equ WDT_WINDOW_gm = 0xF0                ; Window group mask
.equ WDT_WINDOW_gp = 4                   ; Window group position
.equ WDT_WINDOW_0_bm = (1<<4)            ; Window bit 0 mask
.equ WDT_WINDOW_0_bp = 4                 ; Window bit 0 position
.equ WDT_WINDOW_1_bm = (1<<5)            ; Window bit 1 mask
.equ WDT_WINDOW_1_bp = 5                 ; Window bit 1 position
.equ WDT_WINDOW_2_bm = (1<<6)            ; Window bit 2 mask
.equ WDT_WINDOW_2_bp = 6                 ; Window bit 2 position
.equ WDT_WINDOW_3_bm = (1<<7)            ; Window bit 3 mask
.equ WDT_WINDOW_3_bp = 7                 ; Window bit 3 position

; WDT_STATUS masks
.equ WDT_SYNCBUSY_bm = 0x01              ; Syncronization busy bit mask
.equ WDT_SYNCBUSY_bp = 0                 ; Syncronization busy bit position
.equ WDT_LOCK_bm = 0x80                  ; Lock enable bit mask
.equ WDT_LOCK_bp = 7                     ; Lock enable bit position

; Period select
.equ WDT_PERIOD_OFF_gc = (0x00<<0)       ; Off
.equ WDT_PERIOD_8CLK_gc = (0x01<<0)      ; 8 cycles (8ms)
.equ WDT_PERIOD_16CLK_gc = (0x02<<0)     ; 16 cycles (16ms)
.equ WDT_PERIOD_32CLK_gc = (0x03<<0)     ; 32 cycles (32ms)
.equ WDT_PERIOD_64CLK_gc = (0x04<<0)     ; 64 cycles (64ms)
.equ WDT_PERIOD_128CLK_gc = (0x05<<0)    ; 128 cycles (0.128s)
.equ WDT_PERIOD_256CLK_gc = (0x06<<0)    ; 256 cycles (0.256s)
.equ WDT_PERIOD_512CLK_gc = (0x07<<0)    ; 512 cycles (0.512s)
.equ WDT_PERIOD_1KCLK_gc = (0x08<<0)     ; 1K cycles (1.0s)
.equ WDT_PERIOD_2KCLK_gc = (0x09<<0)     ; 2K cycles (2.0s)
.equ WDT_PERIOD_4KCLK_gc = (0x0A<<0)     ; 4K cycles (4.1s)
.equ WDT_PERIOD_8KCLK_gc = (0x0B<<0)     ; 8K cycles (8.2s)

; Window select
.equ WDT_WINDOW_OFF_gc = (0x00<<4)       ; Off
.equ WDT_WINDOW_8CLK_gc = (0x01<<4)      ; 8 cycles (8ms)
.equ WDT_WINDOW_16CLK_gc = (0x02<<4)     ; 16 cycles (16ms)
.equ WDT_WINDOW_32CLK_gc = (0x03<<4)     ; 32 cycles (32ms)
.equ WDT_WINDOW_64CLK_gc = (0x04<<4)     ; 64 cycles (64ms)
.equ WDT_WINDOW_128CLK_gc = (0x05<<4)    ; 128 cycles (0.128s)
.equ WDT_WINDOW_256CLK_gc = (0x06<<4)    ; 256 cycles (0.256s)
.equ WDT_WINDOW_512CLK_gc = (0x07<<4)    ; 512 cycles (0.512s)
.equ WDT_WINDOW_1KCLK_gc = (0x08<<4)     ; 1K cycles (1.0s)
.equ WDT_WINDOW_2KCLK_gc = (0x09<<4)     ; 2K cycles (2.0s)
.equ WDT_WINDOW_4KCLK_gc = (0x0A<<4)     ; 4K cycles (4.1s)
.equ WDT_WINDOW_8KCLK_gc = (0x0B<<4)     ; 8K cycles (8.2s)


;*************************************************************************
;** WEX - Waveform Extension
;*************************************************************************

; WEX_CTRLA masks
.equ WEX_DTI0EN_bm = 0x01                ; Dead-Time Insertion CMP0 Enable bit mask
.equ WEX_DTI0EN_bp = 0                   ; Dead-Time Insertion CMP0 Enable bit position
.equ WEX_DTI1EN_bm = 0x02                ; Dead-Time Insertion CMP1 Enable bit mask
.equ WEX_DTI1EN_bp = 1                   ; Dead-Time Insertion CMP1 Enable bit position
.equ WEX_DTI2EN_bm = 0x04                ; Dead-Time Insertion CMP2 Enable bit mask
.equ WEX_DTI2EN_bp = 2                   ; Dead-Time Insertion CMP2 Enable bit position
.equ WEX_DTI3EN_bm = 0x08                ; Dead-Time Insertion CMP3 Enable bit mask
.equ WEX_DTI3EN_bp = 3                   ; Dead-Time Insertion CMP3 Enable bit position
.equ WEX_INMX_gm = 0x70                  ; Input Matrix group mask
.equ WEX_INMX_gp = 4                     ; Input Matrix group position
.equ WEX_INMX_0_bm = (1<<4)              ; Input Matrix bit 0 mask
.equ WEX_INMX_0_bp = 4                   ; Input Matrix bit 0 position
.equ WEX_INMX_1_bm = (1<<5)              ; Input Matrix bit 1 mask
.equ WEX_INMX_1_bp = 5                   ; Input Matrix bit 1 position
.equ WEX_INMX_2_bm = (1<<6)              ; Input Matrix bit 2 mask
.equ WEX_INMX_2_bp = 6                   ; Input Matrix bit 2 position
.equ WEX_PGM_bm = 0x80                   ; Pattern Generation Mode bit mask
.equ WEX_PGM_bp = 7                      ; Pattern Generation Mode bit position

; WEX_CTRLB masks
.equ WEX_UPDSRC_gm = 0x03                ; Update Source group mask
.equ WEX_UPDSRC_gp = 0                   ; Update Source group position
.equ WEX_UPDSRC_0_bm = (1<<0)            ; Update Source bit 0 mask
.equ WEX_UPDSRC_0_bp = 0                 ; Update Source bit 0 position
.equ WEX_UPDSRC_1_bm = (1<<1)            ; Update Source bit 1 mask
.equ WEX_UPDSRC_1_bp = 1                 ; Update Source bit 1 position

; WEX_CTRLC masks
.equ WEX_CMD_gm = 0x07                   ; Command group mask
.equ WEX_CMD_gp = 0                      ; Command group position
.equ WEX_CMD_0_bm = (1<<0)               ; Command bit 0 mask
.equ WEX_CMD_0_bp = 0                    ; Command bit 0 position
.equ WEX_CMD_1_bm = (1<<1)               ; Command bit 1 mask
.equ WEX_CMD_1_bp = 1                    ; Command bit 1 position
.equ WEX_CMD_2_bm = (1<<2)               ; Command bit 2 mask
.equ WEX_CMD_2_bp = 2                    ; Command bit 2 position

; WEX_EVCTRLA masks
.equ WEX_FAULTEI_bm = 0x01               ; Fault Event Input Enable bit mask
.equ WEX_FAULTEI_bp = 0                  ; Fault Event Input Enable bit position
.equ WEX_BLANK_bm = 0x02                 ; Fault Event Blanking Enable bit mask
.equ WEX_BLANK_bp = 1                    ; Fault Event Blanking Enable bit position
.equ WEX_FILTER_gm = 0x1C                ; Fault Event Filter Enable group mask
.equ WEX_FILTER_gp = 2                   ; Fault Event Filter Enable group position
.equ WEX_FILTER_0_bm = (1<<2)            ; Fault Event Filter Enable bit 0 mask
.equ WEX_FILTER_0_bp = 2                 ; Fault Event Filter Enable bit 0 position
.equ WEX_FILTER_1_bm = (1<<3)            ; Fault Event Filter Enable bit 1 mask
.equ WEX_FILTER_1_bp = 3                 ; Fault Event Filter Enable bit 1 position
.equ WEX_FILTER_2_bm = (1<<4)            ; Fault Event Filter Enable bit 2 mask
.equ WEX_FILTER_2_bp = 4                 ; Fault Event Filter Enable bit 2 position

