QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
; WEX_EVCTRLB masks
; Masks for WEX_FAULTEI already defined
; Masks for WEX_BLANK already defined
; Masks for WEX_FILTER already defined

; WEX_EVCTRLC masks
; Masks for WEX_FAULTEI already defined
; Masks for WEX_BLANK already defined
; Masks for WEX_FILTER already defined

; WEX_BUFCTRL masks
.equ WEX_DTLSBV_bm = 0x01                ; Dead-time Low Side Buffer Valid bit mask
.equ WEX_DTLSBV_bp = 0                   ; Dead-time Low Side Buffer Valid bit position
.equ WEX_DTHSBV_bm = 0x02                ; Dead-time High Side Buffer Valid bit mask
.equ WEX_DTHSBV_bp = 1                   ; Dead-time High Side Buffer Valid bit position
.equ WEX_SWAPBV_bm = 0x04                ; Swap Buffer Valid bit mask
.equ WEX_SWAPBV_bp = 2                   ; Swap Buffer Valid bit position
.equ WEX_PGMOVRBV_bm = 0x08              ; PGM Override Buffer Valid bit mask
.equ WEX_PGMOVRBV_bp = 3                 ; PGM Override Buffer Valid bit position
.equ WEX_PGMOUTBV_bm = 0x10              ; PGM Output Value Buffer Valid bit mask
.equ WEX_PGMOUTBV_bp = 4                 ; PGM Output Value Buffer Valid bit position

; WEX_BLANKCTRL masks
.equ WEX_BLANKSRC_bm = 0x01              ; Blanking Trigger Source bit mask
.equ WEX_BLANKSRC_bp = 0                 ; Blanking Trigger Source bit position
.equ WEX_BLANKTRIG_gm = 0x1C             ; Blanking Trigger group mask
.equ WEX_BLANKTRIG_gp = 2                ; Blanking Trigger group position
.equ WEX_BLANKTRIG_0_bm = (1<<2)         ; Blanking Trigger bit 0 mask
.equ WEX_BLANKTRIG_0_bp = 2              ; Blanking Trigger bit 0 position
.equ WEX_BLANKTRIG_1_bm = (1<<3)         ; Blanking Trigger bit 1 mask
.equ WEX_BLANKTRIG_1_bp = 3              ; Blanking Trigger bit 1 position
.equ WEX_BLANKTRIG_2_bm = (1<<4)         ; Blanking Trigger bit 2 mask
.equ WEX_BLANKTRIG_2_bp = 4              ; Blanking Trigger bit 2 position
.equ WEX_BLANKPRESC_gm = 0x60            ; Blanking Prescaler group mask
.equ WEX_BLANKPRESC_gp = 5               ; Blanking Prescaler group position
.equ WEX_BLANKPRESC_0_bm = (1<<5)        ; Blanking Prescaler bit 0 mask
.equ WEX_BLANKPRESC_0_bp = 5             ; Blanking Prescaler bit 0 position
.equ WEX_BLANKPRESC_1_bm = (1<<6)        ; Blanking Prescaler bit 1 mask
.equ WEX_BLANKPRESC_1_bp = 6             ; Blanking Prescaler bit 1 position

; WEX_FAULTCTRL masks
.equ WEX_FDACT_gm = 0x03                 ; Fault Detection Action group mask
.equ WEX_FDACT_gp = 0                    ; Fault Detection Action group position
.equ WEX_FDACT_0_bm = (1<<0)             ; Fault Detection Action bit 0 mask
.equ WEX_FDACT_0_bp = 0                  ; Fault Detection Action bit 0 position
.equ WEX_FDACT_1_bm = (1<<1)             ; Fault Detection Action bit 1 mask
.equ WEX_FDACT_1_bp = 1                  ; Fault Detection Action bit 1 position
.equ WEX_FDMODE_bm = 0x04                ; Fault Detection Restart Mode bit mask
.equ WEX_FDMODE_bp = 2                   ; Fault Detection Restart Mode bit position
.equ WEX_FDDBD_bm = 0x80                 ; Fault Detection on Debug Break Detection bit mask
.equ WEX_FDDBD_bp = 7                    ; Fault Detection on Debug Break Detection bit position

; WEX_FAULTDRV masks
.equ WEX_FAULTDRV0_bm = 0x01             ; Fault Drive Enable Bit 0 bit mask
.equ WEX_FAULTDRV0_bp = 0                ; Fault Drive Enable Bit 0 bit position
.equ WEX_FAULTDRV1_bm = 0x02             ; Fault Drive Enable Bit 1 bit mask
.equ WEX_FAULTDRV1_bp = 1                ; Fault Drive Enable Bit 1 bit position
.equ WEX_FAULTDRV2_bm = 0x04             ; Fault Drive Enable Bit 2 bit mask
.equ WEX_FAULTDRV2_bp = 2                ; Fault Drive Enable Bit 2 bit position
.equ WEX_FAULTDRV3_bm = 0x08             ; Fault Drive Enable Bit 3 bit mask
.equ WEX_FAULTDRV3_bp = 3                ; Fault Drive Enable Bit 3 bit position
.equ WEX_FAULTDRV4_bm = 0x10             ; Fault Drive Enable Bit 4 bit mask
.equ WEX_FAULTDRV4_bp = 4                ; Fault Drive Enable Bit 4 bit position
.equ WEX_FAULTDRV5_bm = 0x20             ; Fault Drive Enable Bit 5 bit mask
.equ WEX_FAULTDRV5_bp = 5                ; Fault Drive Enable Bit 5 bit position
.equ WEX_FAULTDRV6_bm = 0x40             ; Fault Drive Enable Bit 6 bit mask
.equ WEX_FAULTDRV6_bp = 6                ; Fault Drive Enable Bit 6 bit position
.equ WEX_FAULTDRV7_bm = 0x80             ; Fault Drive Enable Bit 7 bit mask
.equ WEX_FAULTDRV7_bp = 7                ; Fault Drive Enable Bit 7 bit position

; WEX_FAULTOUT masks
.equ WEX_FAULTOUT0_bm = 0x01             ; Fault Output Value Bit 0 bit mask
.equ WEX_FAULTOUT0_bp = 0                ; Fault Output Value Bit 0 bit position
.equ WEX_FAULTOUT1_bm = 0x02             ; Fault Output Value Bit 1 bit mask
.equ WEX_FAULTOUT1_bp = 1                ; Fault Output Value Bit 1 bit position
.equ WEX_FAULTOUT2_bm = 0x04             ; Fault Output Value Bit 2 bit mask
.equ WEX_FAULTOUT2_bp = 2                ; Fault Output Value Bit 2 bit position
.equ WEX_FAULTOUT3_bm = 0x08             ; Fault Output Value Bit 3 bit mask
.equ WEX_FAULTOUT3_bp = 3                ; Fault Output Value Bit 3 bit position
.equ WEX_FAULTOUT4_bm = 0x10             ; Fault Output Value Bit 4 bit mask
.equ WEX_FAULTOUT4_bp = 4                ; Fault Output Value Bit 4 bit position
.equ WEX_FAULTOUT5_bm = 0x20             ; Fault Output Value Bit 5 bit mask
.equ WEX_FAULTOUT5_bp = 5                ; Fault Output Value Bit 5 bit position
.equ WEX_FAULTOUT6_bm = 0x40             ; Fault Output Value Bit 6 bit mask
.equ WEX_FAULTOUT6_bp = 6                ; Fault Output Value Bit 6 bit position
.equ WEX_FAULTOUT7_bm = 0x80             ; Fault Output Value Bit 7 bit mask
.equ WEX_FAULTOUT7_bp = 7                ; Fault Output Value Bit 7 bit position

; WEX_INTCTRL masks
.equ WEX_FAULTDET_bm = 0x01              ; Fault Detection Interrupt Enable bit mask
.equ WEX_FAULTDET_bp = 0                 ; Fault Detection Interrupt Enable bit position

; WEX_INTFLAGS masks
; Masks for WEX_FAULTDET already defined
.equ WEX_FDFEVA_bm = 0x04                ; Fault Detection Flag Event Input A bit mask
.equ WEX_FDFEVA_bp = 2                   ; Fault Detection Flag Event Input A bit position
.equ WEX_FDFEVB_bm = 0x08                ; Fault Detection Flag Event Input B bit mask
.equ WEX_FDFEVB_bp = 3                   ; Fault Detection Flag Event Input B bit position
.equ WEX_FDFEVC_bm = 0x10                ; Fault Detection Flag Event Input C bit mask
.equ WEX_FDFEVC_bp = 4                   ; Fault Detection Flag Event Input C bit position

