QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR16EB20def.inc
; WEX_PGMOVRBUF masks
.equ WEX_PGMOVRBUF0_bm = 0x01            ; Pattern Generation Override Enable Buffer Bit 0 bit mask
.equ WEX_PGMOVRBUF0_bp = 0               ; Pattern Generation Override Enable Buffer Bit 0 bit position
.equ WEX_PGMOVRBUF1_bm = 0x02            ; Pattern Generation Override Enable Buffer Bit 1 bit mask
.equ WEX_PGMOVRBUF1_bp = 1               ; Pattern Generation Override Enable Buffer Bit 1 bit position
.equ WEX_PGMOVRBUF2_bm = 0x04            ; Pattern Generation Override Enable Buffer Bit 2 bit mask
.equ WEX_PGMOVRBUF2_bp = 2               ; Pattern Generation Override Enable Buffer Bit 2 bit position
.equ WEX_PGMOVRBUF3_bm = 0x08            ; Pattern Generation Override Enable Buffer Bit 3 bit mask
.equ WEX_PGMOVRBUF3_bp = 3               ; Pattern Generation Override Enable Buffer Bit 3 bit position
.equ WEX_PGMOVRBUF4_bm = 0x10            ; Pattern Generation Override Enable Buffer Bit 4 bit mask
.equ WEX_PGMOVRBUF4_bp = 4               ; Pattern Generation Override Enable Buffer Bit 4 bit position
.equ WEX_PGMOVRBUF5_bm = 0x20            ; Pattern Generation Override Enable Buffer Bit 5 bit mask
.equ WEX_PGMOVRBUF5_bp = 5               ; Pattern Generation Override Enable Buffer Bit 5 bit position
.equ WEX_PGMOVRBUF6_bm = 0x40            ; Pattern Generation Override Enable Buffer Bit 6 bit mask
.equ WEX_PGMOVRBUF6_bp = 6               ; Pattern Generation Override Enable Buffer Bit 6 bit position
.equ WEX_PGMOVRBUF7_bm = 0x80            ; Pattern Generation Override Enable Buffer Bit 7 bit mask
.equ WEX_PGMOVRBUF7_bp = 7               ; Pattern Generation Override Enable Buffer Bit 7 bit position

; WEX_PGMOUTBUF masks
.equ WEX_PGMOUTBUF0_bm = 0x01            ; Pattern Generation Output Value Buffer Bit 0 bit mask
.equ WEX_PGMOUTBUF0_bp = 0               ; Pattern Generation Output Value Buffer Bit 0 bit position
.equ WEX_PGMOUTBUF1_bm = 0x02            ; Pattern Generation Output Value Buffer Bit 1 bit mask
.equ WEX_PGMOUTBUF1_bp = 1               ; Pattern Generation Output Value Buffer Bit 1 bit position
.equ WEX_PGMOUTBUF2_bm = 0x04            ; Pattern Generation Output Value Buffer Bit 2 bit mask
.equ WEX_PGMOUTBUF2_bp = 2               ; Pattern Generation Output Value Buffer Bit 2 bit position
.equ WEX_PGMOUTBUF3_bm = 0x08            ; Pattern Generation Output Value Buffer Bit 3 bit mask
.equ WEX_PGMOUTBUF3_bp = 3               ; Pattern Generation Output Value Buffer Bit 3 bit position
.equ WEX_PGMOUTBUF4_bm = 0x10            ; Pattern Generation Output Value Buffer Bit 4 bit mask
.equ WEX_PGMOUTBUF4_bp = 4               ; Pattern Generation Output Value Buffer Bit 4 bit position
.equ WEX_PGMOUTBUF5_bm = 0x20            ; Pattern Generation Output Value Buffer Bit 5 bit mask
.equ WEX_PGMOUTBUF5_bp = 5               ; Pattern Generation Output Value Buffer Bit 5 bit position
.equ WEX_PGMOUTBUF6_bm = 0x40            ; Pattern Generation Output Value Buffer Bit 6 bit mask
.equ WEX_PGMOUTBUF6_bp = 6               ; Pattern Generation Output Value Buffer Bit 6 bit position
.equ WEX_PGMOUTBUF7_bm = 0x80            ; Pattern Generation Output Value Buffer Bit 7 bit mask
.equ WEX_PGMOUTBUF7_bp = 7               ; Pattern Generation Output Value Buffer Bit 7 bit position

; Blanking Prescaler select
.equ WEX_BLANKPRESC_DIV1_gc = (0x00<<5)  ; No prescaling
.equ WEX_BLANKPRESC_DIV4_gc = (0x01<<5)  ; Divide CLK_PER by 4
.equ WEX_BLANKPRESC_DIV16_gc = (0x02<<5) ; Divide CLK_PER by 16
.equ WEX_BLANKPRESC_DIV64_gc = (0x03<<5) ; Divide CLK_PER by 64

; Blanking Trigger Source select
.equ WEX_BLANKSRC_TCPWM0_gc = (0x00<<0)  ; TCPWM0

; Blanking Trigger select
.equ WEX_BLANKTRIG_NONE_gc = (0x00<<2)   ; No HW blanking trigger. SW blanking only
.equ WEX_BLANKTRIG_UPDATE_gc = (0x01<<2) ; T/C Update Condition
.equ WEX_BLANKTRIG_CMP0_gc = (0x02<<2)   ; Compare Match 0
.equ WEX_BLANKTRIG_CMP1_gc = (0x03<<2)   ; Compare Match 1
.equ WEX_BLANKTRIG_CMP2_gc = (0x04<<2)   ; Compare Match 2
.equ WEX_BLANKTRIG_CMP3_gc = (0x05<<2)   ; Compare Match 3

; Input Matrix select
.equ WEX_INMX_DIRECT_gc = (0x00<<4)      ; Direct from TCE0
.equ WEX_INMX_CWCMA_gc = (0x02<<4)       ; Common Waveform Channel Mode A. Single WO
.equ WEX_INMX_CWCMB_gc = (0x03<<4)       ; Common Waveform Channel Mode B. WO from two PWM channels

; Update Source select
.equ WEX_UPDSRC_TCPWM0_gc = (0x00<<0)    ; Timer/Counter for PWM 0 update condition
.equ WEX_UPDSRC_NONE_gc = (0x03<<0)      ; No hardware update condition

; Command select
.equ WEX_CMD_NONE_gc = (0x00<<0)         ; No Command
.equ WEX_CMD_UPDATE_gc = (0x01<<0)       ; Force update of Dead-time, SWAP and PGM buffer registers.
.equ WEX_CMD_FAULTSET_gc = (0x02<<0)     ; Set Fault Detection
.equ WEX_CMD_FAULTCLR_gc = (0x03<<0)     ; Clear Fault Detection.
.equ WEX_CMD_BLANKSET_gc = (0x04<<0)     ; Set SW Blanking
.equ WEX_CMD_BLANKCLR_gc = (0x05<<0)     ; Clear SW Blanking

; Fault Event Filter Enable select
.equ WEX_FILTER_ZERO_gc = (0x00<<2)      ; No digital filter
.equ WEX_FILTER_SAMPLE1_gc = (0x01<<2)   ; One Sample
.equ WEX_FILTER_SAMPLE2_gc = (0x02<<2)   ; Two Samples
.equ WEX_FILTER_SAMPLE3_gc = (0x03<<2)   ; Three Samples
.equ WEX_FILTER_SAMPLE4_gc = (0x04<<2)   ; Four Samples
.equ WEX_FILTER_SAMPLE5_gc = (0x05<<2)   ; Five Samples
.equ WEX_FILTER_SAMPLE6_gc = (0x06<<2)   ; Six Samples
.equ WEX_FILTER_SAMPLE7_gc = (0x07<<2)   ; Seven Samples

; Fault Detection Action select
.equ WEX_FDACT_NONE_gc = (0x00<<0)       ; None. Fault Protection Disabled
.equ WEX_FDACT_LOW_gc = (0x01<<0)        ; Drive all pins low
.equ WEX_FDACT_CUSTOM_gc = (0x03<<0)     ; Drive all pins to setting defined by FAULTDRV and FAULTVAL

; Fault Detection on Debug Break Detection select
.equ WEX_FDDBD_FAULT_gc = (0x00<<7)      ; OCD Break request is treated as a fault if fault protection is enabled
.equ WEX_FDDBD_IGNORE_gc = (0x01<<7)     ; OCD Breask request will not trigger a fault

; Fault Detection Restart Mode select
.equ WEX_FDMODE_LATCHED_gc = (0x00<<2)   ; Latched Mode. Output will remain in fault state until fault condition is no longer active and FDF is cleared by SW.
.equ WEX_FDMODE_CBC_gc = (0x01<<2)       ; Cycle-by-cycle mode. Waveform output will remain in fault state until fault condition is no longer active.

; Blanking State select
.equ WEX_BLANKSTATE_OFF_gc = (0x00<<7)   ; Blanking off
.equ WEX_BLANKSTATE_ON_gc = (0x01<<7)    ; Blanking active

; Fault Detection State select
.equ WEX_FDSTATE_NORMAL_gc = (0x00<<0)   ; Normal state
.equ WEX_FDSTATE_FAULT_gc = (0x01<<0)    ; Fault state




; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30


; ***** DATA MEMORY DECLARATIONS *****************************************


#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x10000
#define DATAMEM_END (0x0000 + 0x10000 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x103F
#define IO_END (0x0000 + 0x103F - 1)

